{
    "banner": [
      {
        "image": "assets/banner/banner-1.webp",
        "titre": "Raphael Philippot – Integrateur Web, Développeur Web Front-End.",
        "description": "Bienvenue sur mon portfolio ! Je suis Raphael Philippot, passionné de développement web front-end basé à Béziers. Avec un goût prononcé pour la création d'interfaces utilisateur intuitives et esthétiques, je m'efforce de donner vie à des expériences web exceptionnelles. Explorez mes pro-jets ci-dessous pour découvrir mon approche du développement front-end."
      },
      {
        "image": "assets/banner/banner-2.webp",
        "titre": "Découvrez mes réalisations",
        "description": "Explorez une sélection de projets sur lesquels j'ai travaillé. Chaque projet représente un défi unique et met en lumière mes compétences en développement web."
      }
    ],
    "projets": [
      {
        "titre": "Booki",
        "description_courte": "Création d'un site d'agence de voyage en HTML5 et CSS3, intégration en desktop, et adaptation responsive mobile.",
        "description_complete": "Création d'un site Web en HTML5 / CSS3, à l'aide d'une maquette proposée vie l'outil Figma. Manipulation des techniques css flexbox et grid, pour obtenir des visuels propres et ordonnés, autant en mode desktop, qu'en version mobile.",
        "image_acceuil": "assets/booki/acceuil-booki.webp",
        "images_apercu": ["assets/booki/booki-1.webp", "assets/booki/booki-2.webp", "assets/booki/booki-3.webp"],
        "code" : "https://github.com/Nonnorso/Booki.git"
      },
      {
        "titre": "OhMyFood",
        "description_courte": "Site en HTML5 / CSS3, codé en 'mobile first' incluant de nombreuses animations CSS pour un visuel interactif.",
        "description_complete": "Création d'un site mobile first, incluant de nombreuses animations, notamment de survol, selection et chargement, en vue de developper une page interactive pour un projet de commande en ligne de menus aupres des restaurants participants. Conçu pour les formats mobile, le site s'adapte également aux plus grands formats pour une accessibilité sur tous types d'écrans.",
        "image_acceuil": "assets/ohmyfood/acceuil-ohmyfood.webp",
        "images_apercu": ["assets/ohmyfood/ohmyfood-1.webp", "assets/ohmyfood/ohmyfood-2.webp", "assets/ohmyfood/ohmyfood-3.webp"],
        "code" : "https://github.com/Nonnorso/Projet-4-OhMyFood-Philippot-Raphael.git"
      },
      {
        "titre": "Print It",
        "description_courte": "Mordernisation d'un site web d'impression HTML5 / CSS3, en y incorporant un slider codé en JavaScript.",
        "description_complete": "Mise à jour d'un site internet d'impression HMTL5 / CSS3. Remplacement de la bannière statique du site par un carrousel d'images décrivant toutes leurs prestations au fur et à mesure du défilement des slides. Configuration d'un défilemnt infini ordonné, et ajouts de bulletpoints permettant une navigation fluide et selective des diapos. ",
        "image_acceuil": "assets/printit/acceuil-printit.webp",
        "images_apercu": ["assets/printit/printit-1.webp", "assets/printit/printit-2.webp", "assets/printit/printit-3.webp"],
        "code" : "https://github.com/Nonnorso/Print_It.git"
      },
      {
        "titre": "Sophie Bluel Architecte",
        "description_courte": "Création d'une galerie dynamique à l'aide de JavaScript pour afficher et/ou supprimer les travaux de Sophie Bluel au travers de modales dédiées.",
        "description_complete": "Mise à jour du site de Sophie Bluel Architecte afin de dynamiser la gestion de sa gallerie. Importation des travaux depuis une API REST, gestion des travaux au travers de modales dynamiques créées en JavaScript et gestion des operations de récuperation, tri et suppression des travaux de la gallerie grâces aux requettes API. Rendu des modifications apportées instantanné avec JavaScript.",
        "image_acceuil": "assets/sba/acceuil-sba.webp",
        "images_apercu": ["assets/sba/sba-1.webp", "assets/sba/sba-2.webp", "assets/sba/sba-3.webp"],
        "code" : "https://github.com/Nonnorso/Sophie_Bluel_Architecte.git"
      },
      {
        "titre": "Kasa",
        "description_courte": "Création d'une application React pour la mise en location de biens de particuliers avec de nombreux composants interactifs.",
        "description_complete": "Création d'une application React pour la mise en location de logements, configuration d'un routage avec des pages securisées et chargement dynamique des données au format Json. Possibilité d'herberger les données auprès d'une API. Création de divers composants interactifs et réutilisables, proposant à l'utilisateur une panel de fonctionnalités interactives au travers de composants animés.",
        "image_acceuil": "assets/kasa/acceuil-kasa.webp",
        "images_apercu": ["assets/kasa/kasa-1.webp", "assets/kasa/kasa-2.webp", "assets/kasa/kasa-3.webp"],
        "code" : "https://github.com/Nonnorso/Creez_une_application_web_de_location_immobiliere_avec_React.git"
      },
      {
        "titre": "Nina Carducci Photographe",
        "description_courte": "Optimisation du réferencement d'un site HTML5 / CSS3 / Javascript de Nina Carducci Photographe. Utilisation de diverses outils et extensions de navigateur web, pour parvenir à un resultat optimal.",
        "description_complete": "Optimisation du réferencement d'un site HTML5 / CSS3 / Javascript de Nina Carducci Photographe. Analyse approfondie du code et refonte sémantique complète, gestion du poids des données d'images en les compressant et utilisant des formats plus adaptés au web, et de bibliotheques, et autres fichiers de scripts en les minifiants. Ajout d'un referencement local pour accroitre la visibilité du site, et des balises de partages sur les principaux réseaux sociaux.",
        "image_acceuil": "assets/ncp/acceuil-ncp.webp",
        "images_apercu": ["assets/ncp/ncp-1.webp", "assets/ncp/ncp-2.webp", "assets/ncp/ncp-3.webp"],
        "code" :"https://github.com/Nonnorso/Optimisez-le-referencement-d-un-site-de-photographe.git"
      },
      {
        "titre": "724events",
        "description_courte": "Application React d'une agence d'evenementiel, innachevée et buguée. Correction de tous les bugs et achèvement de l'application pour répondre aux besoins de l'entreprise.",
        "description_complete": "Correction et achèvement d'une application React d'une agence d'évenementiel. Analyse approfondie du code, et des tests unitaires prévus pour assurer le bon fonctionnement des composants. Correction des composants et de l'entièreté du code, pour permettre le bon fonctionnement de toutes les fonctionnalitées prévues et désirées de l'agence pour son application web.",
        "image_acceuil": "assets/724e/acceuil-724e.webp",
        "images_apercu": ["assets/724e/724e-1.webp", "assets/724e/724e-2.webp", "assets/724e/724e-3.webp"],
        "code" : "https://github.com/Nonnorso/Debuggez-le-site-d-une-agence-d-evenementiel.git"
      },
      {
        "titre": "ARGENTBANK",
        "description_courte": "Création d'une application de banque avec React, et gestion de l'état avec Redux. Création de routes protegées pour les pages utulisateur et gestion dynamique des données avec une API et MongoDB.",
        "description_complete": "Création d'une application de banque avec React, et gestion de l'état avec Redux. Création d'une route protegées et gestion des authentification renforcée avec un token fournis par l'API uniquement avec les bons identifiants de l'utilisateur enregistré. Vérification à toutes étapes de la navigation de l'utilisateur connecté, de la présence et authenticité du token fournis, et sécurisation des données à tout moment. Dynamisation de l'application gérée par Redux et le store provider, gestion de l'état et des modifications au niveau du front end en simultané avec les modifications apportées au back-end grâce à la communication à l'API et à Redux.",
        "image_acceuil": "assets/argentbank/acceuil-argentbank.webp",
        "images_apercu": ["assets/argentbank/argentbank-1.webp", "assets/argentbank/argentbank-2.webp", "assets/argentbank/argentbank-3.webp"],
        "code" : "https://github.com/Nonnorso/ArgentBank.git"
      }
    ],
    "skills": [
      {
        "image": "assets/skill/HTML5.webp",
        "titre": "HTML5"
      },
      {
        "image": "assets/skill/css.webp",
        "titre": "CSS3"
      },
      {
        "image": "assets/skill/sass.webp",
        "titre": "SASS"
      },
      {
        "image": "assets/skill/JavaScript.webp",
        "titre": "JavaScript"
      },
      {
        "image": "assets/skill/react.webp",
        "titre": "React"
      },
      {
        "image": "assets/skill/reactrouter.webp",
        "titre": "React Router"
      },
      {
        "image": "assets/skill/redux.webp",
        "titre": "Redux"
      },
      {
        "image": "assets/skill/vsc.webp",
        "titre": "Visual Studio Code"
      },
      {
        "image": "assets/skill/github.webp",
        "titre": "Git / Github"
      },
      {
        "image": "assets/skill/node.webp",
        "titre": "NodeJs"
      },
      {
        "image": "assets/skill/npm.webp",
        "titre": "Npm"
      },
      {
        "image": "assets/skill/Yarn.webp",
        "titre": "Yarn"
      }
    ]
  }
  